In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({
        'one': pd.Series(np.random.randn(3), index=['a', 'b', 'c']),
        'two': pd.Series(np.random.randn(4), index=['a', 'b', 'c', 'd']),
        'three': pd.Series(np.random.randn(3), index=['b', 'c', 'd'])})

In [5]:
df2 = df.copy()
df2

        one       two     three
a  0.534501  0.854013       NaN
b -0.588717  1.258035  0.326289
c -0.620037 -0.779833 -0.459528
d       NaN -0.100561  0.979264

## Bool comparisons

In [4]:
# eq, ne, lt, gt, le, and ge binary comparison methods
# np.nan == np.nan returns False 
df.gt(df2)

     one    two  three
a  False  False  False
b  False  False  False
c  False  False  False
d  False  False  False

In [6]:
# apply reductions using empty, any(), all(), bool() to summarize booleans 
(df > 0).all()

one      False
two      False
three    False
dtype: bool

In [7]:
(df > 0).any()

one      True
two      True
three    True
dtype: bool

In [8]:
# chain any, return True if any are True
(df > 0).any().any()

True

In [9]:
# if df: pass - doesn't work because comparing multiple values
# so is df and df2

In [10]:
# evaluating a single-element pandas objects in a bool use: bool()
pd.Series([True]).bool()

True

In [11]:
pd.Series([False]).bool()

False

In [12]:
# note double sqr brackets for dataframe 
pd.DataFrame([[False]]).bool()

False

## Objects comparison

In [13]:
pd.Series(['foo', 'bar', 'baz']) == 'foo'

0     True
1    False
2    False
dtype: bool

In [14]:
# can compare different array-like objects as long as the *same length
pd.Series(['foo', 'bar', 'baz']) == pd.Index(['foo', 'bar', 'qux'])

0     True
1     True
2    False
dtype: bool

In [17]:
# df + df != df * 2 
# because np.nan == np.nan 
# to test equality with NaNs treated as equal must use .equals() 
# must be in the same order for equality to be true (?) 
print(df + df == df * 2)
print((df+df).equals(df * 2))

     one   two  three
a   True  True  False
b   True  True   True
c   True  True   True
d  False  True   True
True

## Descriptive Statistics

In [18]:
# diff aggregate, takes axis argument or just 0 for column
# see documentation for diff agg methods: median, min, max, mode, abs, prod, std, var, sem
df.mean(axis=0)

one     -0.224751
two      0.307914
three    0.282008
dtype: float64

In [19]:
# axis = 1 for rows
df.mean(axis=1)

a    0.694257
b    0.331869
c   -0.619799
d    0.439351
dtype: float64

In [20]:
# standardization can be done easily: score-mean divided by stdDev
ts_stand = (df - df.mean()) / df.std()

In [22]:
ts_stand.std()

one      1.0
two      1.0
three    1.0
dtype: float64

## Describe 
* to get summary statistics of a series or column

In [26]:
series = pd.Series(np.random.randn(1000))

In [24]:
series[::2] = np.nan

In [25]:
series.describe()

count    500.000000
mean      -0.059010
std        1.000826
min       -2.991147
25%       -0.769805
50%       -0.060723
75%        0.611726
max        3.133921
dtype: float64

In [27]:
frame = pd.DataFrame(np.random.randn(1000, 5), columns=['a', 'b', 'c', 'd', 'e'])

In [28]:
frame.iloc[::2] = np.nan
frame.describe()

                a           b           c           d           e
count  500.000000  500.000000  500.000000  500.000000  500.000000
mean     0.000746    0.052119    0.034347   -0.017196    0.012884
std      1.021396    1.000238    1.013864    1.003590    0.999418
min     -3.725053   -3.369950   -2.637563   -4.213504   -2.459132
25%     -0.740722   -0.605389   -0.685633   -0.697675   -0.677597
50%     -0.017812    0.061046    0.016388   -0.021574    0.002207
75%      0.658188    0.712248    0.723247    0.613429    0.648969
max      2.951101    2.735166    3.156357    3.021812    3.469681

## Index of min/max values

In [29]:
s1 = pd.Series(np.random.randn(5))
s1.idxmin(), s1.idxmax()

(1, 3)

In [32]:
df1 = pd.DataFrame(np.random.randn(5, 3), columns=['A', 'B', 'C'])
df1

          A         B         C
0 -0.567916 -0.068178  0.852649
1 -3.422664 -1.413576 -0.610035
2  0.955888 -1.191175  1.493363
3 -0.444092  1.572235 -1.200104
4 -0.119219 -0.887303  0.242438

In [31]:
df1.idxmin(axis=0) #for each column

A    2
B    3
C    1
dtype: int64

In [33]:
df1.idxmax(axis=1) #for each row

0    C
1    C
2    C
3    B
4    C
dtype: object

## Iterations

* iterating over rows is usually not needed and can be avoided (using a for loop)
* items(): to iterate over the (key, value) pairs.
* iterrows(): Iterate over the rows of a DataFrame as (index, Series) pairs. This converts the rows to Series objects, which can change the dtypes and has some performance implications.
* itertuples(): Iterate over the rows of a DataFrame as namedtuples of the values. This is a lot faster than iterrows() and is in most cases preferable to use to iterate over the values of a DataFrame.

In [36]:
df = pd.DataFrame({'a': [1, 2, 3], 'b': ['a', 'b', 'c']})
df

   a  b
0  1  a
1  2  b
2  3  c

In [35]:
# iterating through key/val pairs
for label, ser in df.items():
        print(label)
        print(ser)

a
0    1
1    2
2    3
Name: a, dtype: int64
b
0    a
1    b
2    c
Name: b, dtype: object

In [37]:
# iterating through rows 
for row_index, row in df.iterrows():
        print(row_index, row, sep='\n')

0
a    1
b    a
Name: 0, dtype: object
1
a    2
b    b
Name: 1, dtype: object
2
a    3
b    c
Name: 2, dtype: object

In [38]:
# iterating through as tuples - fastest way
for row in df.itertuples():
        print(row)

Pandas(Index=0, a=1, b='a')
Pandas(Index=1, a=2, b='b')
Pandas(Index=2, a=3, b='c')

## Object Creation

In [40]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [41]:
dates = pd.date_range('20130101', periods=6)

In [42]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [43]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABDC'))

In [44]:
df

                   A         B         D         C
2013-01-01 -0.279604 -0.585506  0.631505 -0.033700
2013-01-02 -0.012464  1.046965  2.005944  0.039476
2013-01-03 -0.926993  0.321759  1.039092  0.194858
2013-01-04 -0.655870 -0.965013  1.043033 -1.662098
2013-01-05  1.966806 -1.445549  0.842907  0.474365
2013-01-06  0.235944  1.986643 -1.120519 -0.808946

In [45]:
df2 = pd.DataFrame({'A': 1.0,
                       'B': pd.Timestamp('20130102'),
                       'C': pd.Series(1, index=list(range(4)), dtype='float32'),
                       'D': np.array([3] * 4, dtype='int32'),
                       'E': pd.Categorical(["test", "train", "test", "train"]),
                       'F': 'foo'})

In [46]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [47]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [52]:
# tab completion for column names - attributes that can be completed 
# see link for more, e.g.: .columns, .apply, .all, .add . bool

### Viewing Data

In [53]:
df.head()

                   A         B         D         C
2013-01-01 -0.279604 -0.585506  0.631505 -0.033700
2013-01-02 -0.012464  1.046965  2.005944  0.039476
2013-01-03 -0.926993  0.321759  1.039092  0.194858
2013-01-04 -0.655870 -0.965013  1.043033 -1.662098
2013-01-05  1.966806 -1.445549  0.842907  0.474365

In [54]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [55]:
df.columns

Index(['A', 'B', 'D', 'C'], dtype='object')

In [56]:
# convert to numpy array 
# remember numpy must have one dtype for the whole array 
# will try to cast as one dtype that can hold all dtypes 
# essentially turns everything to a python obejct - very memory/time consuming

In [57]:
df.describe()

              A         B         D         C
count  6.000000  6.000000  6.000000  6.000000
mean   0.054637  0.059883  0.740327 -0.299341
std    1.027025  1.302964  1.026430  0.793098
min   -0.926993 -1.445549 -1.120519 -1.662098
25%   -0.561803 -0.870136  0.684355 -0.615135
50%   -0.146034 -0.131873  0.941000  0.002888
75%    0.173842  0.865664  1.042048  0.156013
max    1.966806  1.986643  2.005944  0.474365

In [58]:
# transpose data:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.279604   -0.012464   -0.926993   -0.655870    1.966806    0.235944
B   -0.585506    1.046965    0.321759   -0.965013   -1.445549    1.986643
D    0.631505    2.005944    1.039092    1.043033    0.842907   -1.120519
C   -0.033700    0.039476    0.194858   -1.662098    0.474365   -0.808946

In [63]:
df.sort_index(axis=1, ascending=False) # sorts columns backwards

                   D         C         B         A
2013-01-01  0.631505 -0.033700 -0.585506 -0.279604
2013-01-02  2.005944  0.039476  1.046965 -0.012464
2013-01-03  1.039092  0.194858  0.321759 -0.926993
2013-01-04  1.043033 -1.662098 -0.965013 -0.655870
2013-01-05  0.842907  0.474365 -1.445549  1.966806
2013-01-06 -1.120519 -0.808946  1.986643  0.235944

In [64]:
df.sort_values(by='B') #sort by a column

                   A         B         D         C
2013-01-05  1.966806 -1.445549  0.842907  0.474365
2013-01-04 -0.655870 -0.965013  1.043033 -1.662098
2013-01-01 -0.279604 -0.585506  0.631505 -0.033700
2013-01-03 -0.926993  0.321759  1.039092  0.194858
2013-01-02 -0.012464  1.046965  2.005944  0.039476
2013-01-06  0.235944  1.986643 -1.120519 -0.808946

### Filtering

In [65]:
# column: df[col] - returns series
# row label: df.loc[label] - returns series
# by row int: df.iloc[loc] - returns series
# slice row: df[5:10] - returns df
# select rows by boolean vector: df[bool_vec] - returns df

In [66]:
df['A'] #columns

2013-01-01   -0.279604
2013-01-02   -0.012464
2013-01-03   -0.926993
2013-01-04   -0.655870
2013-01-05    1.966806
2013-01-06    0.235944
Freq: D, Name: A, dtype: float64

In [67]:
df[0:3] #rows

                   A         B         D         C
2013-01-01 -0.279604 -0.585506  0.631505 -0.033700
2013-01-02 -0.012464  1.046965  2.005944  0.039476
2013-01-03 -0.926993  0.321759  1.039092  0.194858

In [68]:
df.loc["2013-01-01"] #row based on value

A   -0.279604
B   -0.585506
D    0.631505
C   -0.033700
Name: 2013-01-01 00:00:00, dtype: float64

In [69]:
df.loc[:,['A','B']] #row, then columns

                   A         B
2013-01-01 -0.279604 -0.585506
2013-01-02 -0.012464  1.046965
2013-01-03 -0.926993  0.321759
2013-01-04 -0.655870 -0.965013
2013-01-05  1.966806 -1.445549
2013-01-06  0.235944  1.986643

In [72]:
df.loc[:,'A']

2013-01-01   -0.279604
2013-01-02   -0.012464
2013-01-03   -0.926993
2013-01-04   -0.655870
2013-01-05    1.966806
2013-01-06    0.235944
Freq: D, Name: A, dtype: float64

In [71]:
df.loc['20130102':'20130104', ['A','B']]
# note changes in dimension this will return a data frame

                   A         B
2013-01-02 -0.012464  1.046965
2013-01-03 -0.926993  0.321759
2013-01-04 -0.655870 -0.965013

In [73]:
df.loc[dates[0],'A'] 
# will return a scalara value

-0.27960387436381207

In [74]:
# SELECT BY POSITION using .iloc 
# same as python starts with 0 and non-inclusive endpoint
df.iloc[3]
# returns row 4

A   -0.655870
B   -0.965013
D    1.043033
C   -1.662098
Name: 2013-01-04 00:00:00, dtype: float64

In [75]:
df.iloc[3:5, 0:2]
# returns row 3 and 4, then 0 and 1

                   A         B
2013-01-04 -0.655870 -0.965013
2013-01-05  1.966806 -1.445549

In [76]:
df.iloc[1:3, :] # for all the columns

                   A         B         D         C
2013-01-02 -0.012464  1.046965  2.005944  0.039476
2013-01-03 -0.926993  0.321759  1.039092  0.194858

In [78]:
# SELECTION BY dtype
df = pd.DataFrame({'string': list('abc'),
                       'int64': list(range(1, 4)),
                       'uint8': np.arange(3, 6).astype('u1'),
                       'float64': np.arange(4.0, 7.0),
                       'bool1': [True, False, True],
                       'bool2': [False, True, False],
                       'dates': pd.date_range('now', periods=3),
                       'category': pd.Series(list("ABC")).astype('category')})
df.select_dtypes(include=[bool])

   bool1  bool2
0   True  False
1  False   True
2   True  False

### Boolean Indexing

In [79]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABDC'))

In [80]:
df

                   A         B         D         C
2013-01-01  0.663492 -0.152711  0.887368 -1.292755
2013-01-02 -0.002188  0.874608  1.379640  0.162147
2013-01-03  0.148043 -0.793267  0.830307 -0.613611
2013-01-04 -0.413448  0.506829  0.542767  0.883253
2013-01-05  0.477098 -2.164726  0.249291 -0.018426
2013-01-06  0.553695  1.139791 -0.298865 -1.202517

In [81]:
df[df['A'] > 0]

                   A         B         D         C
2013-01-01  0.663492 -0.152711  0.887368 -1.292755
2013-01-03  0.148043 -0.793267  0.830307 -0.613611
2013-01-05  0.477098 -2.164726  0.249291 -0.018426
2013-01-06  0.553695  1.139791 -0.298865 -1.202517

In [83]:
df2 = df.copy()

In [85]:
df2['E'] = ['one','two','three','four','five','six']

In [86]:
df2

                   A         B         D         C      E
2013-01-01  0.663492 -0.152711  0.887368 -1.292755    one
2013-01-02 -0.002188  0.874608  1.379640  0.162147    two
2013-01-03  0.148043 -0.793267  0.830307 -0.613611  three
2013-01-04 -0.413448  0.506829  0.542767  0.883253   four
2013-01-05  0.477098 -2.164726  0.249291 -0.018426   five
2013-01-06  0.553695  1.139791 -0.298865 -1.202517    six

In [87]:
df2[df2['E'].isin(['one','two'])]

                   A         B         D         C    E
2013-01-01  0.663492 -0.152711  0.887368 -1.292755  one
2013-01-02 -0.002188  0.874608  1.379640  0.162147  two

In [88]:
# settings values by position
# df.iat[0,1] = -1

# by iloc
# df.iloc[0,1] = 2

# by label
# df.at[0, 'float64'] = -10
# df.loc[0, 'float64'] = -20

# by numpy array
# df.loc[:, 'uint8'] = np.array([50] * len(df))

In [90]:
df.loc[:, 'A'] = np.array([50] * len(df))
# must be the same length

In [91]:
df

             A         B         D         C
2013-01-01  50 -1.000000  0.887368 -1.292755
2013-01-02  50  0.874608  1.379640  0.162147
2013-01-03  50 -0.793267  0.830307 -0.613611
2013-01-04  50  0.506829  0.542767  0.883253
2013-01-05  50 -2.164726  0.249291 -0.018426
2013-01-06  50  1.139791 -0.298865 -1.202517

### Merge and Group Bys

In [97]:
df = pd.DataFrame(np.random.randn(10, 4))
df[:3]

          0         1         2         3
0 -0.131510  1.104369  0.549329 -0.591566
1  0.144074 -0.755649 -0.085253 -0.430248
2 -1.291302 -0.351061 -2.287368  0.597217

In [96]:
pieces = [df[:3], df[3:7], df[7:]]
# pd.concat to join multiple slices to gether 
# similar to UNION in SQL
pd.concat(pieces)

          0         1         2         3
0 -1.177119  0.010832  0.209105 -0.765922
1  1.101143 -0.760277  1.448553  1.702123
2 -0.526027 -1.413700 -1.078386 -0.726374
3  1.513632 -2.348834 -0.672796  0.169786
4  0.434421 -0.912696 -1.257466  1.289155
5  0.761086  0.156703 -0.236844  1.453490
6  1.756746  1.749328  0.906662  0.101719
7  1.124137 -0.905815 -0.384768  0.207451
8  0.568039  0.490516 -0.529050  1.432301
9 -0.976724 -0.817900 -0.592923 -0.784955

In [ ]:
# pd.merge(df1, df2, on='key', how='outer') 
# similar to JOIN in SQL
# default is inner join

In [ ]:
# groupby 
# splits the data into groups based on criteria
# applies function to each group independently
# combines results into a data structure

In [98]:
df = pd.DataFrame({'A': ['foo', 'bar', 'foo', 'bar',
                             'foo', 'bar', 'foo', 'foo'],
                        'B': ['one', 'one', 'two', 'three',
                          'two', 'two', 'one', 'three'],
                       'C': np.random.randn(8),
                       'D': np.random.randn(8)})

In [99]:
df.head()

     A      B         C         D
0  foo    one  1.547161  1.562714
1  bar    one  2.901011  1.722731
2  foo    two -1.496998  1.195411
3  bar  three  0.237869  0.697783
4  foo    two  0.243290 -1.777017

In [100]:
df.groupby('A').sum()

            C         D
A
bar  3.389898  1.406427
foo -1.031779  1.132141

In [ ]:
# for multiple groupbys 
# can create dictionary before hand to better use
# df.groupby('A').agg({'C': np.sum, 'D': np.max})

#### Stack

stack() - compresses a level in df's columns

In [101]:
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz',
                         'foo', 'foo', 'qux', 'qux'],
                        ['one', 'two', 'one', 'two',
                         'one', 'two', 'one', 'two']]))

In [102]:
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])

In [103]:
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=['A', 'B'])

In [104]:
df2 = df[:4]

In [105]:
df2.head()

                     A         B
first second
bar   one     0.589602  0.339924
      two     1.577954  1.463689
baz   one    -1.346262  2.364578
      two    -1.282740 -0.545364

In [106]:
# stack just turns columns to rows instead for readability 

df2_stacked = df2.stack()
df2_stacked

first  second
bar    one     A    0.589602
               B    0.339924
       two     A    1.577954
               B    1.463689
baz    one     A   -1.346262
               B    2.364578
       two     A   -1.282740
               B   -0.545364
dtype: float64

In [107]:
df2_stacked.dtype
# note that type is float - because it's multi-indexed only left with the values from the column

dtype('float64')

In [112]:
# inverse is unstack, default based on first level but can be changed
df2_stacked.unstack(1)

second        one       two
first
bar   A  0.589602  1.577954
      B  0.339924  1.463689
baz   A -1.346262 -1.282740
      B  2.364578 -0.545364

#### Pivot Tables

In [113]:
df = pd.DataFrame({'A': ['one', 'one', 'two', 'three'] * 3,
                       'B': ['A', 'B', 'C'] * 4,
                       'C': ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
                       'D': np.random.randn(12),
                       'E': np.random.randn(12)})

In [116]:
df.head(10)

       A  B    C         D         E
0    one  A  foo  1.059862 -0.751549
1    one  B  foo -1.900895 -0.016225
2    two  C  foo  0.627855  0.429483
3  three  A  bar  0.324684  0.491846
4    one  B  bar  0.039836 -0.576719
5    one  C  bar -0.160637 -1.444465
6    two  A  foo  1.748541  1.550302
7  three  B  foo  2.077546 -1.503659
8    one  C  foo -0.418996 -1.646391
9    one  A  bar  2.095950  0.065358

In [114]:
pd.pivot_table(df, values='D', index=['A', 'B'], columns=['C'])

C             bar       foo
A     B
one   A  2.095950  1.059862
      B  0.039836 -1.900895
      C -0.160637 -0.418996
three A  0.324684       NaN
      B       NaN  2.077546
      C -0.350998       NaN
two   A       NaN  1.748541
      B -1.731790       NaN
      C       NaN  0.627855

#### pivot tables
[pivottable_reading](https://www.lumeer.io/pivot-table-complete-guide/)

### Apply Functions

* access functions outside of pandas
* pipe() for tablewise functions
* apply() for row and column wise function

In [ ]:
# pipe is for passing a df through multiple functions 
# example: (df_p.pipe(extract_city_name).pipe(add_country_name, country_name="US"))

In [ ]:
# apply to access numpy functions
# df.apply(np.mean, axis=1) 
# can pass functions df.apply(lambda x: x.max() - x.min())
# can pass own functions df.apply(own_func)
# when passing own functions that take argument - args must be passed a tuple even if only uses one argumnet:
# df.apply(subtract_and_divide, args=(5,3)) or df.apply(subtract_and_divide, args=(5,))